Masmiseim36/nxpSDK/devices/MIMXRT1181/drivers/fsl_flexcan.c
/* Array of FlexCAN peripheral base address. */
static CAN_Type *const s_flexcanBases[] = CAN_BASE_PTRS;

/* Array of FlexCAN IRQ number. */
#ifdef CAN_Rx_Warning_IRQS
static const IRQn_Type s_flexcanRxWarningIRQ[] = CAN_Rx_Warning_IRQS;
#endif
#ifdef CAN_Tx_Warning_IRQS
static const IRQn_Type s_flexcanTxWarningIRQ[] = CAN_Tx_Warning_IRQS;
#endif
#ifdef CAN_Wake_Up_IRQS
static const IRQn_Type s_flexcanWakeUpIRQ[]    = CAN_Wake_Up_IRQS;
#endif
#ifdef CAN_Error_IRQS
static const IRQn_Type s_flexcanErrorIRQ[]     = CAN_Error_IRQS;
#endif
#ifdef CAN_Bus_Off_IRQS
static const IRQn_Type s_flexcanBusOffIRQ[]    = CAN_Bus_Off_IRQS;
#endif
#ifdef CAN_ORed_Message_buffer_IRQS
#ifdef FSL_FEATURE_FLEXCAN_MB_IRQ_COUNT
static const IRQn_Type s_flexcanMbIRQ[][FSL_FEATURE_FLEXCAN_MB_IRQ_COUNT] = CAN_ORed_Message_buffer_IRQS;
#else
static const IRQn_Type s_flexcanMbIRQ[]        = CAN_ORed_Message_buffer_IRQS;
#endif
#endif

/* Array of FlexCAN handle. */
static flexcan_handle_t *s_flexcanHandle[ARRAY_SIZE(s_flexcanBases)];

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/* Array of FlexCAN clock name. */
static const clock_ip_name_t s_flexcanClock[] = FLEXCAN_CLOCKS;
#if defined(FLEXCAN_PERIPH_CLOCKS)
/* Array of FlexCAN serial clock name. */
static const clock_ip_name_t s_flexcanPeriphClock[] = FLEXCAN_PERIPH_CLOCKS;
#endif /* FLEXCAN_PERIPH_CLOCKS */
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(FLEXCAN_RESETS_ARRAY)
/* Reset array */
static const reset_ip_name_t s_flexcanResets[] = FLEXCAN_RESETS_ARRAY;
#endif

/* FlexCAN ISR for transactional APIs. */
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
static flexcan_isr_t s_flexcanIsr = (flexcan_isr_t)DefaultISR;
static flexcan_isr_t s_flexcanBusoffErrorIsr = (flexcan_isr_t)DefaultISR;
static flexcan_mb_isr_t s_flexcanMbIsr = (flexcan_mb_isr_t)DefaultISR;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_PN_MODE) && FSL_FEATURE_FLEXCAN_HAS_PN_MODE)
static flexcan_isr_t s_flexcanPNWakeUpErrorIsr = (flexcan_isr_t)DefaultISR;
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL) && FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL)
static flexcan_isr_t s_flexcanMemoryErrorErrorIsr = (flexcan_isr_t)DefaultISR;
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO) && FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO)
static flexcan_isr_t s_flexcanEhancedRxFifoIsr = (flexcan_isr_t)DefaultISR;
#endif
#else
static flexcan_isr_t s_flexcanIsr;
static flexcan_isr_t s_flexcanBusoffErrorIsr;
static flexcan_mb_isr_t s_flexcanMbIsr;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_PN_MODE) && FSL_FEATURE_FLEXCAN_HAS_PN_MODE)
static flexcan_isr_t s_flexcanPNWakeUpErrorIsr;
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL) && FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL)
static flexcan_isr_t s_flexcanMemoryErrorErrorIsr;
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO) && FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO)
static flexcan_isr_t s_flexcanEhancedRxFifoIsr;
#endif
#endif

/*******************************************************************************
 * Implementation of 32-bit memset
 ******************************************************************************/

static void flexcan_memset(void *s, uint32_t c, size_t n)
{
    size_t m;
    volatile uint32_t *ptr = s;

    m = n / sizeof(*ptr);

    while ((m--) != (size_t)0)
    {
        *ptr++ = c;
    }
}

/*******************************************************************************
 * Code
 ******************************************************************************/
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
/*!
 * brief Determine whether the FlexCAN instance support CAN FD mode at run time.
 *
 * note Use this API only if different soc parts share the SOC part name macro define. Otherwise, a different SOC part
 *      name can be used to determine at compile time whether the FlexCAN instance supports CAN FD mode or not.
 *      If need use this API to determine if CAN FD mode is supported, the FLEXCAN_Init function needs to be
 *      executed first, and then call this API and use the return to value determines whether to supports CAN FD mode,
 *      if return true, continue calling FLEXCAN_FDInit to enable CAN FD mode.
 *
 * param base FlexCAN peripheral base address.
 * return return TRUE if instance support CAN FD mode, FALSE if instance only support classic CAN (2.0) mode.
 */
bool FLEXCAN_IsInstanceHasFDMode(CAN_Type *base)
{
    /* Enter Freeze Mode. */
    FLEXCAN_EnterFreezeMode(base);
    /* Enable CAN FD operation. */
    base->MCR |= CAN_MCR_FDEN_MASK;

    /*
     * $Branch Coverage Justification$
     * (0U == (base->MCR & CAN_MCR_FDEN_MASK)) not covered. $ref flexcan_c_ref_2$.
     */
    /* There are some SoC parts that don't support CAN FD.
     * Checking if FDEN bit is really set to 1 is a way to ensure that CAN FD is supported.
     * When SoC parts don't support CAN FD, FDEN bit stuck at 0 and can't be set to 1. */
    if (0U == (base->MCR & CAN_MCR_FDEN_MASK))
    {
        /* Exit Freeze Mode. */
        FLEXCAN_ExitFreezeMode(base);
        return false;
    }
    else
    {
        /* Clear CAN FD operation. */
        base->MCR &= ~CAN_MCR_FDEN_MASK;
        /* Exit Freeze Mode. */
        FLEXCAN_ExitFreezeMode(base);
        return true;
    }
}
#endif

/*!
 * brief Get the FlexCAN instance from peripheral base address.
 *
 * param base FlexCAN peripheral base address.
 * return FlexCAN instance.
 */
uint32_t FLEXCAN_GetInstance(CAN_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_flexcanBases); instance++)
    {
        if (MSDK_REG_SECURE_ADDR(s_flexcanBases[instance]) == MSDK_REG_SECURE_ADDR(base))
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_flexcanBases));

    return instance;
}

/*!
 * brief Enter FlexCAN Freeze Mode.
 *
 * This function makes the FlexCAN work under Freeze Mode.
 *
 * param base FlexCAN peripheral base address.
 */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_9595) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_9595)
void FLEXCAN_EnterFreezeMode(CAN_Type *base)
{
    uint32_t u32TimeoutCount = 0U;
    uint32_t u32TempMCR      = 0U;
    uint32_t u32TempIMASK1   = 0U;
#if defined(CAN_IMASK2_BUF63TO32M_MASK)
    uint32_t u32TempIMASK2 = 0U;
#endif

    /* Step1: set FRZ enable in MCR. */
    base->MCR |= CAN_MCR_FRZ_MASK;

    /* Step2: to check if MDIS bit set in MCR. if yes, clear it. */
    if (0U != (base->MCR & CAN_MCR_MDIS_MASK))
    {
        base->MCR &= ~CAN_MCR_MDIS_MASK;
    }

    /* Step3: polling LPMACK. */
    u32TimeoutCount = (uint32_t)FLEXCAN_WAIT_TIMEOUT;
    while ((0U == (base->MCR & CAN_MCR_LPMACK_MASK)) && (u32TimeoutCount > 0U))
    {
        u32TimeoutCount--;
    }

    /* Step4: to check FLTCONF in ESR1 register */
    if (0U == (base->ESR1 & CAN_ESR1_FLTCONF_BUSOFF))
    {
        /* Error Active and Error Passive state */
        /* Step5B: Set Halt bits. */
        base->MCR |= CAN_MCR_HALT_MASK;

